       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.
       PROCEDURE DIVISION.
       ONLY-PARA.
           DISPLAY 'HELLO WORLD!'.
           STOP RUN.
